In [1]:
import pandas as pd

In [2]:
raw_data = {"firstname": ("Mike", "James", "John", "Mike", "Fred", "Douglas"),
            "lastname": ("Doe", "Cameroon", "Cooper", "Doe", "Den", "Marian"),
            "age": (23, 43, 21, 23, 42, 43),
            "pretestscore": (4, 6, 3, 4, 54, 23),
            "posttestscore": (75, 32, 65, 75, 91, 74)}
df = pd.DataFrame(raw_data, columns=("firstname", "lastname", "age", "pretestscore", "posttestscore"))
print(df)

  firstname  lastname  age  pretestscore  posttestscore
0      Mike       Doe   23             4             75
1     James  Cameroon   43             6             32
2      John    Cooper   21             3             65
3      Mike       Doe   23             4             75
4      Fred       Den   42            54             91
5   Douglas    Marian   43            23             74

In [3]:
df.drop_duplicates()

  firstname  lastname  age  pretestscore  posttestscore
0      Mike       Doe   23             4             75
1     James  Cameroon   43             6             32
2      John    Cooper   21             3             65
4      Fred       Den   42            54             91
5   Douglas    Marian   43            23             74

In [4]:
data = pd.read_csv("titanic.csv")
print(data.head(10))

   passenger_id  pclass                                               name  \
0          1216       3                                 Smyth, Miss. Julia
1           699       3                                    Cacic, Mr. Luka
2          1267       3  Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...
3           449       2              Hocking, Mrs. Elizabeth (Eliza Needs)
4           576       2                                    Veal, Mr. James
5          1083       3                           Olsen, Mr. Henry Margido
6           898       3                    Johnson, Mr. William Cahoone Jr
7           560       2                              Sinkkonen, Miss. Anna
8          1079       3                                 Ohman, Miss. Velin
9           908       3                           Jussila, Miss. Mari Aina

      sex   age  sibsp  parch  ticket     fare cabin embarked boat   body  \
0  female   NaN      0      0  335432   7.7333   NaN        Q   13    NaN
1    male  38.0      0      0  315089   8.6625   NaN        S  NaN    NaN
2  female  30.0      1      1  345773  24.1500   NaN        S  NaN    NaN
3  female  54.0      1      3   29105  23.0000   NaN        S    4    NaN
4    male  40.0      0      0   28221  13.0000   NaN        S  NaN    NaN
5    male  28.0      0      0  C 4001  22.5250   NaN        S  NaN  173.0
6    male  19.0      0      0    LINE   0.0000   NaN        S  NaN    NaN
7  female  30.0      0      0  250648  13.0000   NaN        S   10    NaN
8  female  22.0      0      0  347085   7.7750   NaN        S    C    NaN
9  female  21.0      1      0    4137   9.8250   NaN        S  NaN    NaN

                  home.dest  survived
0                       NaN         1
1                   Croatia         0
2                       NaN         0
3      Cornwall / Akron, OH         1
4  Barre, Co Washington, VT         0
5                       NaN         0
6                       NaN         0
7  Finland / Washington, DC         1
8                       NaN         1
9                       NaN         0